# cask <application> -  will run `brew cask install`
# brew <application> -  will run `brew install`

# dev environmnet
cask "iterm2"
cask "alfred"
cask "docker"
brew "zsh"
brew "fzf"
brew "tmux"
brew "git"

# Other services
brew "redis"

# essential libraries
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "openssl"
