# cask <application> - will run `brew cask install`
# brew <application> - will run `brew install`

# dev environmnet
cask "iterm2"
cask "alfred"
cask "docker"
brew "zsh"
brew "fzf"
brew "tmux"
brew "git"
tap "homebrew/cask-fonts"
cask "font-fantasque-sans-mono"
brew "the_silver_searcher"
tap "heroku/brew"
brew "heroku"
cask "postman"
brew "vim"
cask "sublime-text"
cask "dash"
cask "gitkraken"
cask "visual-studio-code"
cask "graphiql"
brew "yarn"
# cask "flycut"
cask "alacritty"

# react native
brew "watchman"
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk8"
cask "react-native-debugger"
tap "wix/brew"
brew "applesimutils"

# Ruby
# brew "openssl"
# brew "libyaml"
brew "libffi"

# Other services
brew "redis"

# essential libraries
brew "coreutils"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"

# personal stuff
cask "discord"
cask "pandora"
